public class Main {
    public static void main(String[] args) {
        int price = 100; // стоимость билета
        int bonus = 20; // кол-во рублей за 1 бонусную милю
        System.out.println(price / bonus);

        int miles = 5;
        System.out.println(miles);
    }

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран


}
